{
  "data": "0b35edf8",
  "case name": "J' MARKETING CORPORATION, ROGELIO U. SOYAO, EVP-General Manager, PEPITO P. ESTRELLAN, Kalibo Branch Manager, petitioners, vs. FERNANDO S. IGUIZ, respondent. [G.R. No. 211522. September 4, 2019.]",
  "name of lawyer": "Not applicable.",
  "nature": "Individual v. Employer",
  "court": "From the Labor Arbiter (LA) to the National Labor Relations Commission (NLRC) to the Court of Appeals (CA) to the Supreme Court (SC) which ruled on the case with finality.",
  "date": "September 4, 2019 (SC Decision)",
  "case type": "Termination of Employment - Illegal Termination (Just Causes)",
  "focus of dispute": "Whether or not the appellate court committed reversible error in upholding the finding of the NLRC that Iguiz was illegally dismissed from his employment and is entitled to backwages, separation pay, damages, and attorney's fees.",
  "legal facts": "Fernando S. Iguiz was hired by J' Marketing Corporation (JMC) as a driver in September 1995 and later promoted to collector/credit investigator. On 11 December 2006, Iguiz was found short in his remittance collection by P5,811. He explained that the amount was lost due to a flood caused by typhoon 'Siniang'. JMC did not pursue further investigation. Later, an audit revealed that Iguiz had unremitted collections of P15,300 and $29 from 14 customers without issuing official receipts. Iguiz denied these allegations, but JMC terminated his employment on 7 March 2007 for dishonesty and breach of trust.",
  "judgement and reason": "The Supreme Court ruled that the petition lacks merit. JMC failed to provide substantial evidence to justify the termination of Iguiz's employment. The Court found that JMC did not observe the procedural due process requirements, including the twin notice requirement and the opportunity for a hearing. Therefore, Iguiz's dismissal was deemed illegal, and he is entitled to backwages, separation pay, moral damages, exemplary damages, and attorney's fees.",
  "citations": [
    "Tiu v. NLRC, 290 Phil. 15, 24 (1992)",
    "Floren Hotel v. National Labor Relations Commission, 497 Phil. 458, 472 (2005)",
    "Gabisay v. National Labor Relations Commission, 366 Phil. 593, 601 (1999)",
    "Naranjo v. Biomedica Health Care, Inc., 695 Phil. 551, 563 (2012)",
    "Aliling v. Feliciano, 686 Phil. 889, 912-913 (2012)",
    "Perez v. Phil. Telegraph and Telephone Co., 602 Phil. 522, 536-537 (2009)",
    "King of Kings Transport, Inc. v. Mamac, 553 Phil. 108, 115 (2007)",
    "Santos v. Integrated Pharmaceutical, Inc., 789 Phil. 477, 493 (2016)"
  ],
  "evidence": [
    "Daily Cash Collection Report",
    "Memorandum dated 11 December 2006",
    "Notarized letter-reply dated 14 December 2006",
    "Audit report by Marlon Sonio",
    "Summary list of customers",
    "Affidavits of 14 customers",
    "Administrative Investigation Report",
    "Memorandum dated 8 February 2007",
    "Reply-memorandum dated 12 February 2007",
    "Letter dated 12 February 2007 demanding remittance",
    "Joint Affidavit dated 13 February 2007",
    "Certification from the Office of the Punong Barangay",
    "Memorandum dated 27 February 2007 to Kalibo Police station",
    "Memorandum dated 7 March 2007 terminating employment",
    "Complaint for illegal dismissal with money claims",
    "Decision of Labor Arbiter dated 15 July 2008",
    "Decision of NLRC dated 27 February 2009",
    "Resolution of NLRC dated 31 July 2009",
    "Decision of CA dated 16 July 2013",
    "Resolution of CA dated 30 January 2014"
  ]
}