{
  "data": "0d99ca51",
  "case name": "ELFLEDA, ALBERT, NAPOLEON, EDEN, SEVERIANO, CELIA and LEO, all surnamed MARCELO, represented by SPOUSES SEVERINO ** [Deceased] and CELIA C. MARCELO, petitioners, vs. SAMAHANG MAGSASAKA NG BARANGAY SAN MARIANO represented by GODOFREDO ERMITA, respondent. [G.R. No. 205618. September 16, 2019.]",
  "name of lawyer": "Not applicable.",
  "nature": "Individual v. Government Agency",
  "court": "From the Labor Arbiter (LA) to the National Labor Relations Commission (NLRC) to the Court of Appeals (CA) to the Supreme Court (SC) which ruled on the case with finality.",
  "date": "September 16, 2019, Decision of the Supreme Court. June 28, 2012, Decision of the Court of Appeals. February 4, 2013, Resolution of the Court of Appeals. March 1, 2010, Decision of the Office of the President. May 27, 2010, Resolution of the Office of the President.",
  "case type": "Land Classification and Exemption from CARP Coverage",
  "focus of dispute": "Whether the subject properties were classified as residential prior to June 15, 1988, and are therefore exempt from the Comprehensive Agrarian Reform Program (CARP).",
  "legal facts": "Petitioners, Elfleda, Albert, Napoleon, Eden, Severiano, Celia, and Leo, all surnamed Marcelo, own several parcels of land in Barangay San Mariano, Municipality of San Antonio, Nueva Ecija. They contend that the properties were reclassified as residential prior to June 15, 1988, and are therefore exempt from the CARP. The Department of Agrarian Reform (DAR) initially denied their application for exemption, but the Office of the President (OP) reversed this decision. The Court of Appeals (CA) then reversed the OP's decision, and the Supreme Court ultimately denied the petitioners' application for exemption.",
  "judgement and reason": "The Supreme Court denied the petition, affirming the CA's decision. The Court held that petitioners failed to discharge the burden of proving that the properties were classified as residential in the zoning ordinance and land use plan prior to June 15, 1988, and that such zoning ordinance and land use plan were approved by the HLURB. The Court found that the documents presented by petitioners, such as the NHA certificate of registration and license to sell, and the Sangguniang Bayan Resolution No. 2006-004, did not meet the required criteria for exemption. Therefore, the subject properties remain agricultural and are not exempt from the coverage of the CARP.",
  "citations": [
    "Natalia Realty v. Department of Agrarian Reform, G.R. No. 112954, May 14, 1993.",
    "Pasong Bayabas Farmers Association v. Court of Appeals, G.R. No. 114254, October 28, 1997.",
    "Buklod Nang Magbubukid sa Lupaing Ramos, Inc. v. E.M. Ramos and Sons, Inc., G.R. No. 192144, June 22, 2011.",
    "Ong v. Imperial, G.R. No. 196685, March 2, 2015.",
    "Heirs of Luis A. Luna v. Afable, G.R. No. 196061, August 28, 2013."
  ],
  "evidence": [
    "Certificate of Registration and License to Sell issued by the NHA.",
    "HLURB Certifications dated September 12, 2005, and March 22, 2006.",
    "Sangguniang Bayan Resolution No. 2006-004 dated March 15, 2006.",
    "MPDC Certification dated April 10, 2006.",
    "Affidavit dated August 5, 2006, of a retired MPDC.",
    "Tax declaration receipts and registration certificate and license to sell issued by the NHA.",
    "Various photographs and location map of the landholdings."
  ]
}