{
  "data": "13d7cb47",
  "case name": "IN RE: PETITION TO INVALIDATE THE APPOINTMENT OF SET OF OFFICERS OF CONFEDERATION OF FILIPINO WORKERS-HANES BRANDS, INC., CONFEDERATION OF FILIPINO WORKERS-HANES BRANDS, INC./MARY LENIE SOLIVA/JUBEE HERNANDEZ/MARY JANE PARADELA/JESSIE FABREGAR/GRACE ALCUETAS/RANDY MELLENDEZ/BELEN VARGAS/FORTUNATO SILAYAN/ROBERT ANGELES/RICARDO DECILLO/RICARDO GARMA, petitioners-appellees, vs. CONFEDERATION OF FILIPINO WORKERS/EMMANUEL QUIZON/FORTUNATO SILAYAN/ANNLISA OJASCASTRO/LEONARDO BAUTISTA, respondents-appellants.",
  "name of lawyer": "Not applicable.",
  "nature": "Intra-Union Dispute",
  "court": "From the DOLE Regional Office No. IV-A Mediator-Arbiter to the Bureau of Labor Relations (BLR) which ruled on the case with finality.",
  "date": "October 14, 2019.",
  "case type": "Intra-Union Dispute",
  "focus of dispute": "Whether the appointment of a new set of officers by the OIC-Union President Fortunato Silayan is valid according to the union's constitution and by-laws.",
  "legal facts": "Mary Lenie Soliva, Jubee Hernandez, Mary Jane Cantaveros, Mary Jane Paradela, Jessie Fabregar, Grace Alcuetas, Randy Mellendez, Belen Vargas, Robert Angeles, and Ricardo Garma (Saliva, et al., for brevity) are officers of CFW-Hanes Brands, Inc. Chapter, whose employment were terminated by Hanes Brands, Inc. Emmanuel Quizon, Fortunato Silayan, Annalisa Ojascastro, and Leonardo Bautista were the CFW Executive Vice-President, OIC-President of CFW-Hanes Brands, Inc. local chapter, CFW Coordinator, and 1st Vice-President for Worker Maintenance, respectively. On 17 April 2019, Soliva, et al., filed a Petition to Invalidate the Appointment of Set Officers of CFW-Hanes Brands, Inc. Chapter, alleging that the appointment of the new set of officers by OIC-Union President Fortunato Silayan is not in accordance with the union's constitution and by-laws. On 29 May 2019, Saliva, et al., filed a position paper insisting that the appointment of a new set of officers contravenes the CBL of the union. On 15 July 2019, DOLE Regional Office No. IV-A Mediator-Arbiter Atty. Maureen Zena Serazon-Tongson issued a Resolution granting the petition to invalidate the officers appointed as workers' representatives for CFW-Hanes Brands, Inc. Chapter.",
  "judgement and reason": "The Bureau of Labor Relations affirmed the Resolution of DOLE Regional Office No. IV-A Mediator-Arbiter Atty. Maureen Zena Serazon-Tongson, dismissing the appeal of Confederation of Filipino Workers, Emmanuel Quizon, Fortunato Silayan, Annalisa Ojascastro, and Leonardo Bautista. The Bureau found that the appointment of the new set of officers by Mr. Fortunato Silayan contravened the union's constitution and by-laws. The CBL requires that a declaration of vacancy be made by the CFW Governing Board and that the vacant positions be filled by the President with the approval of the governing board. There was no proof that these requirements were met. Therefore, Soliva, et al., remain the duly constituted officers of CFW-Hanes Brands, Inc. Chapter until the expiration of their term of office as provided in the CBL.",
  "citations": [
    "G.R. Nos. 76579-82, 31 August 1988.",
    "UST Faculty Union vs. Bitonio. G.R. No. 131235, 318 SCRA 185, November 16, 1999."
  ],
  "evidence": [
    "Petition to Invalidate the Appointment of Set Officers of CFW-Hanes Brands, Inc. Chapter.",
    "Position paper filed by Saliva, et al.",
    "Resolution dated 15 July 2019 of DOLE Regional Office No. IV-A Mediator-Arbiter Atty. Maureen Zena Serazon-Tongson.",
    "Letter from Mr. Fortunato Silayan to the Human Resources Manager of Hanes Brand, Inc. dated 21 November 2018.",
    "Constitution and by-laws (CBL) of CFW-Hanes Brands, Inc. Chapter."
  ]
}